Examples/obstacle_new_ps/settings/obstacle_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startFrom_var;

startTime       startTime_var;

stopAt          stopAt_var;

endTime         endTime_var;

deltaT          deltaT_var;

writeControl    writeControl_var;

writeInterval   writeInterval_var;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable runTimeModifiable_var;

adjustTimeStep  yes;

maxCo           maxCo_var;

maxDeltaT       maxDeltaT_var;


// ************************************************************************* //
